// ClassWork (27 September).cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main() {
    int mat[4][4] = {};
    int sum = 0;
    setlocale(LC_ALL, "russian");
    for (int i = 1; i < 5; i++) {
        for (int j = 1; j < 5; j++) {
            mat[i-1][j-1] = i + j;
            sum += i + j;
            std::cout << mat[i-1][j-1];
        }
        std::cout << "\n";
    }
    std::cout << "Сумма всех элементов: " << sum << std::endl;
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть []этот проект позже, вберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.